# HSF-DETR: RT-DETR-R18 with ETB + HCFM + GCConv
# ETB replaces AIFI in the encoder.
# HCFM replaces Concat in cross-scale neck fusion.
# GCConv replaces stride-2 downsampling convolutions in the PAN path.

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, ETB, [8]]                              # 9 ETB encoder
  - [-1, 1, Conv, [256, 1, 1]]                      # 10 Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]      # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]    # 12 input_proj.1
  - [[-2, -1], 1, HCFM, [256, False]]               # 13 HCFM fusion
  - [-1, 3, RepC3, [256, 0.5]]                      # 14 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                      # 15 Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]      # 16
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]    # 17 input_proj.0
  - [[-2, -1], 1, HCFM, [256, True]]                # 18 HCFM fusion
  - [-1, 3, RepC3, [256, 0.5]]                      # 19 X3

  - [-1, 1, GCConv, [256, 3, 2]]                    # 20 GCConv downsample
  - [[-1, 15], 1, HCFM, [256, False]]               # 21 HCFM fusion
  - [-1, 3, RepC3, [256, 0.5]]                      # 22 F4

  - [-1, 1, GCConv, [256, 3, 2]]                    # 23 GCConv downsample
  - [[-1, 10], 1, HCFM, [256, False]]               # 24 HCFM fusion
  - [-1, 3, RepC3, [256, 0.5]]                      # 25 F5

  - [[19, 22, 25], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
